dibo1968/pfc_1phases_dspic33ak/project/pfc/pfc.c
// <editor-fold defaultstate="collapsed" desc="Description/Instruction ">
/**
 * @file pfc.c
 *
 * @brief This module has functions required for Power Factor Correction Control
 */
// </editor-fold>

// <editor-fold defaultstate="collapsed" desc="Disclaimer ">

/*******************************************************************************
* SOFTWARE LICENSE AGREEMENT
* 
* � [2024] Microchip Technology Inc. and its subsidiaries
* 
* Subject to your compliance with these terms, you may use this Microchip 
* software and any derivatives exclusively with Microchip products. 
* You are responsible for complying with third party license terms applicable to
* your use of third party software (including open source software) that may 
* accompany this Microchip software.
* 
* Redistribution of this Microchip software in source or binary form is allowed 
* and must include the above terms of use and the following disclaimer with the
* distribution and accompanying materials.
* 
* SOFTWARE IS "AS IS." NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
* APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT,
* MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL 
* MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR 
* CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO
* THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE 
* POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY
* LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS RELATED TO THE SOFTWARE WILL
* NOT EXCEED AMOUNT OF FEES, IF ANY, YOU PAID DIRECTLY TO MICROCHIP FOR THIS
* SOFTWARE
*
* You agree that you are solely responsible for testing the code and
* determining its suitability.  Microchip has no obligation to modify, test,
* certify, or support the code.
*
*******************************************************************************/
// </editor-fold>

// <editor-fold defaultstate="collapsed" desc="HEADER FILES ">
    
#ifdef __XC16__  // See comments at the top of this header file
    #include <xc.h>
#endif // __XC16__

#include <stdint.h>
#include <stdbool.h>
#include <math.h>       /* sqrtf, for the DCM branch of the duty feed-forward */
#include "libq.h"
#include "pfc.h"
#include "pfc_calc_params.h"
#include "board_service.h"
#include "diagnostics.h"

// </editor-fold> 

// <editor-fold defaultstate="collapsed" desc="Function Declarations ">

static float PFC_SignalRectification(PFC_MEASURE_VOLTAGE_T *);
static float PFC_DcmAverageFactor(PFC_T *);
static float PFC_DutyFeedForward(PFC_T *);
static uint16_t PFC_ConductionModeDetect(PFC_T *);
static void PFC_CurrentSampleCorrection(PFC_T *);
static void PFC_Average(PFC_AVG_T *,float);
static void PFC_SquaredRMSCalculate(PFC_RMS_SQUARE_T *,float);

inline static void PFC_CurrentRefGenerate(PFC_T *);
inline static void PFC_CurrentControlLoop(PFC_T *);

static void PFC_ParamsInit(PFC_T *);
static void PFC_ResetParams(PFC_T *);
static void PFC_FaultCheck(PFC_T *);
void PFC_StateMachine(PFC_T *);

inline static void PFC_UpdateMeasurements(PFC_T *);
inline static void PFC_UpdateCurrentFeedback(PFC_T *);
inline static void PFC_SoftStartUpdate(PFC_T *);
inline static void PFC_UpdateBoostDutyRatio(PFC_T *);
inline static void PFC_BurstModeUpdate(PFC_T *);

static PFC_CTRL_STATE_T PFC_StateInit(PFC_T *);
static PFC_CTRL_STATE_T PFC_StatePrecharge(PFC_T *);
static PFC_CTRL_STATE_T PFC_StateOffsetMeas(PFC_T *);
static PFC_CTRL_STATE_T PFC_StateWait1Cycle(PFC_T *);
static PFC_CTRL_STATE_T PFC_StateCtrlRun(PFC_T *);
static PFC_CTRL_STATE_T PFC_StateFault(PFC_T *);

// </editor-fold> 

// <editor-fold defaultstate="collapsed" desc="Global Variables  ">

PFC_T pfcParam;
uint16_t counter = 0;

// </editor-fold>

// <editor-fold defaultstate="collapsed" desc="INTERFACE FUNCTIONS ">
/**
* <B> Function: PFC_ADCInterrupt()  </B>
*
* @brief ADC interrupt vector ,and it performs following actions:
*        (1) Reads DC BUS voltage,input AC voltage and inductor current feedback 
*            from ADC data buffers.
*        (2) Executes Power Factor Correction State machine
*        (3) Loads duty cycle value generated by PFC current control loop to 
*            PWM Duty Register
*        (4) Executes the DiagnosticsStepIsr() for Data visualization 
*            through X2C Scope
*/
void __attribute__((__interrupt__,no_auto_psv)) PFC_ADCInterrupt()
{    
    /** Load ADC Buffer data to respective variables */
    pfcParam.pfcVoltage.outputVoltage       = ADCBUF_VDC>>1;
    pfcParam.pfcVoltage.acVoltage           = ADCBUF_PFC_VAC;
    pfcParam.pfcCurrent.inductorCurrent     = ADCBUF_PFC_IL;
    pfcParam.pfcCurrent2.inductorCurrent    = ADCBUF_PFC_IL2;
    
    pfcParam.pfcVoltage.vdc  = (float)(pfcParam.pfcVoltage.outputVoltage*ADC_VOLTAGE_SCALE);
    pfcParam.pfcVoltage.vac  = (float)(pfcParam.pfcVoltage.acVoltage*ADC_VOLTAGE_SCALE);
    pfcParam.pfcCurrent.iL   = (float)(pfcParam.pfcCurrent.inductorCurrent*ADC_CURRENT_SCALE);
    pfcParam.pfcCurrent2.iL  = (float)(pfcParam.pfcCurrent2.inductorCurrent*ADC_CURRENT_SCALE);

    /** Load-current feed-forward input: same IL2 sample, load-sensor scale. */
    pfcParam.loadFF.rawADC   = pfcParam.pfcCurrent2.inductorCurrent;
    pfcParam.loadFF.current  = (float)(pfcParam.loadFF.rawADC * pfcParam.loadFF.scale);
    
    
    PFC_StateMachine(&pfcParam);

#ifdef DEBUG_BOOST
    PFC_ENABLE_SIGNAL = 1;
    pfcParam.duty  = DEBUG_PFC_DUTY;
#endif
    
    PFC_PWM_PDC = pfcParam.duty;  
    #ifdef ENABLE_DIAGNOSTICS
    if (counter < (PFC_DIAGNOSTICS_DECIMATION - 1))
    {
        counter++;
    }
    else
    {
        DiagnosticsStepIsr();
        counter = 0;
    }
    #endif

    ClearPFCADCIF();
}
/**
 * <B> Function: PFC_StateMachine(PFC_T *pfcData)  </B>
 * @brief Function to perform  - VAC RMS calculation, calculate moving average 
 *        of Vdc, PFC voltage control loop,  generate current reference, PFC  
 *        current control loop.
 * @param none.
 * @return none.
 * @example
 * <code>
 * status = PFC_StateMachine();
 * </code>
 */
void PFC_StateMachine(PFC_T *pfcData)
{
    PFC_CTRL_STATE_T pfcState = pfcData->state;

    /** Per-ISR signal conditioning, run in every state. */
    PFC_UpdateMeasurements(pfcData);

    switch(pfcState)
    {
        case PFC_INIT:        pfcState = PFC_StateInit(pfcData);       break;
        case PFC_PRECHARGE:   pfcState = PFC_StatePrecharge(pfcData);  break;
        case PFC_OFFSET_MEAS: pfcState = PFC_StateOffsetMeas(pfcData); break;
        case PFC_WAIT_1CYCLE: pfcState = PFC_StateWait1Cycle(pfcData); break;
        case PFC_CTRL_RUN:    pfcState = PFC_StateCtrlRun(pfcData);    break;
        case PFC_FAULT:       pfcState = PFC_StateFault(pfcData);      break;
        default:                                                       break;
    }

    pfcData->state = pfcState;
}
/**
 * <B> Function: PFC_UpdateMeasurements(PFC_T *pfcData) </B>
 * @brief Per-ISR signal conditioning that runs in every state: moving averages
 *        of Vdc and Vac, the AC offset, rectification, the RMS-square of Vac,
 *        and the load-current feed-forward term.
 */
inline static void PFC_UpdateMeasurements(PFC_T *pfcData)
{
    PFC_MEASURE_VOLTAGE_T *pVoltage = &pfcData->pfcVoltage;

    /** Average of PFC output (DC) voltage over one 100 Hz ripple period
        (nulls the double-line ripple - see PFC_VDC_AVG_SAMPLES). */
    PFC_Average(&pfcData->vdcAVG, pVoltage->vdc);
    pfcData->outputVdc = pfcData->vdcAVG.output;

    /** Load-current feed-forward: low-pass the measured load current and form
        the feed-forward power (gain * Vdc * I_load). Injected into the voltage-
        loop power command in PFC_CurrentRefGenerate only when loadFF.enable is
        set, but computed every ISR and always (so it can be observed in X2C
        before enabling). Averaged Vdc avoids injecting bus ripple. */
    pfcData->loadFF.currentFilt += (pfcData->loadFF.current - pfcData->loadFF.currentFilt) * pfcData->loadFF.filtCoeff;
    pfcData->loadFF.powerFF = pfcData->loadFF.gain * pfcData->outputVdc * pfcData->loadFF.currentFilt;

    /** Average of input AC voltage feedback (used as the AC offset). */
    PFC_Average(&pfcData->vacAVG, pVoltage->vac);
    pVoltage->offsetVac = pfcData->vacAVG.output;

