dibo1968/pfc_1phases_dspic33ak/project/pfc/pfc.c
    /** Rectify the input AC voltage. */
    pfcData->rectifiedVac = PFC_SignalRectification(pVoltage);

    /** RMS-square of the rectified input voltage. */
    PFC_SquaredRMSCalculate(&pfcData->vacRMS, pfcData->rectifiedVac);
}
/**
 * <B> Function: PFC_UpdateCurrentFeedback(PFC_T *pfcData) </B>
 * @brief Connect the inductor-current feedback to the control loop, with the
 *        measured offset removed when offset correction is enabled.
 */
inline static void PFC_UpdateCurrentFeedback(PFC_T *pfcData)
{
    /* Always connect the current feedback to the control loop. */
    pfcData->iL = pfcData->pfcCurrent.iL;
#ifdef ENABLE_PFC_CURRENT_OFFSET_CORRECTION
    /* Offset correction is an optional adjustment on top of it. */
    pfcData->iL -= pfcData->pfcCurrent.offset;
#endif
}
/**
 * <B> Function: PFC_SoftStartUpdate(PFC_T *pfcData) </B>
 * @brief Ramp the voltage-loop reference up to nominal at the soft-start rate.
 */
inline static void PFC_SoftStartUpdate(PFC_T *pfcData)
{
    if (pfcData->piVoltage.reference < PFC_OUPUT_VOLTAGE_REFERENCE)
    {
        if(pfcData->rampRate == 0)
        {
            pfcData->piVoltage.reference += RAMP_COUNT;
            pfcData->rampRate = RAMP_RATE;
        }
        else
        {
            pfcData->rampRate--;
        }
    }
    else
    {
        pfcData->piVoltage.reference = PFC_OUPUT_VOLTAGE_REFERENCE;
    }
}
/**
 * <B> Function: PFC_UpdateBoostDutyRatio(PFC_T *pfcData) </B>
 * @brief Compute the ideal boost duty ratio ((Vdc-Vac)/Vdc) from present Vdc,Vac.
 */
inline static void PFC_UpdateBoostDutyRatio(PFC_T *pfcData)
{
    PFC_MEASURE_VOLTAGE_T *pVoltage = &pfcData->pfcVoltage;

    if(pVoltage->vdc > 0)
    {
        /** Boost Duty Ratio = (1 - (Vac/Vdc)) = ((Vdc-Vac)/Vdc) */
        pfcData->boostDutyRatio =
                ((pVoltage->vdc - pfcData->rectifiedVac) / pVoltage->vdc);
    }
}
/**
 * <B> Function: PFC_BurstModeUpdate(PFC_T *pfcData) </B>
 * @brief Burst control at very low load: hold the switch off and freeze the
 *        current integrator below the minimum-power threshold.
 */
inline static void PFC_BurstModeUpdate(PFC_T *pfcData)
{
    /* Test the TOTAL power command, not piVoltage.output. Once the load
       feed-forward carries the load, the voltage-PI output legitimately sits
       near zero AT FULL LOAD, and testing it alone reads that as "no load" and
       switches the converter off under load. SiL 2026-07-27 at loadFF gain 1.0:
       the duty was forced to zero for 22% of the loaded run, in stretches up to
       20 ms, while the feed-forward was asking for 375 W - an 11.4 Hz
       relaxation oscillation with 12 V p-p on the bus. */
    if(pfcData->powerCommand < PFC_MIN_POWER)
    {
        pfcData->duty = 0;
        pfcData->piCurrent.integralOut = 0;
        /* The switch is held off, so the duty that produces the next current
           sample is zero - keep dutyRatio consistent or the conduction-mode
           detector and the DCM factor work off a duty that was never applied. */
        pfcData->dutyRatio = 0;
        pfcData->dutyFF = 0;
    }
}
/**
 * <B> Function: PFC_StateInit(PFC_T *pfcData) </B>
 * @brief PFC_INIT: reset control state, disable PWM, open the inrush relay and
 *        start current-offset measurement. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StateInit(PFC_T *pfcData)
{
    PFC_ResetParams(pfcData);
    HAL_PFCPWMDisableOutputs();
    PFC_INRUSH_RELAY = 0;
    PFC_MeasureCurrentInit(&pfcData->pfcCurrent);

    return PFC_PRECHARGE;
}
/**
 * <B> Function: PFC_StatePrecharge(PFC_T *pfcData) </B>
 * @brief PFC_PRECHARGE: wait for the DC bulk capacitor to charge passively
 *        through the diode bridge and the inrush resistor, then bypass the
 *        inrush resistor with the relay. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StatePrecharge(PFC_T *pfcData)
{
    /** The relay short-circuits the inrush resistor, so the surge it draws is
        set by how far the bus still is from its passive asymptote - the
        rectified input peak less the bridge drops. Referring the completion
        point to that peak instead of to a fixed voltage both minimises the
        surge and keeps precharge working across the declared input range
        (see PFC_PRECHARGE_PEAK_FRACTION).

        vacRMS.sqrOutput is Vrms^2, so the peak is sqrt(2*sqrOutput). Wait for
        the first RMS and AC-offset windows to complete before trusting it:
        until vacAVG converges, offsetVac is still 0 and rectifiedVac - hence
        sqrOutput - is wrong on hardware, where the AC sense sits on a mid-
        scale offset. Both windows close within 20 ms, long before the bus is
        anywhere near the threshold. */
    if((pfcData->vacRMS.status == 1) && (pfcData->vacAVG.status == 1))
    {
        const float peak = sqrtf(2.0f * pfcData->vacRMS.sqrOutput);

        /** vdcAVG.output is the moving average of the measured bus voltage. */
        if(pfcData->vdcAVG.output >= (PFC_PRECHARGE_PEAK_FRACTION * peak))
        {
            PFC_INRUSH_RELAY = 1;
            return PFC_OFFSET_MEAS;
        }
    }
    return PFC_PRECHARGE;
}
/**
 * <B> Function: PFC_StateOffsetMeas(PFC_T *pfcData) </B>
 * @brief PFC_OFFSET_MEAS: accumulate the current-offset average; once the
 *        offset and the AC average are ready, seed the voltage reference and
 *        advance. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StateOffsetMeas(PFC_T *pfcData)
{
    PFC_MEASURE_CURRENT_T *pCurrent = &pfcData->pfcCurrent;

    PFC_MeasureCurrentOffset(pCurrent);

    if((pCurrent->status == 1) && (pfcData->vacAVG.status == 1))
    {
        /** On first completion, set the output-voltage reference to the
            measured DC voltage and enable soft start. */
        pfcData->piVoltage.reference = pfcData->vdcAVG.output;
        pfcData->pfcVoltage.offsetVac = pfcData->vacAVG.output;
        return PFC_WAIT_1CYCLE;
    }
    return PFC_OFFSET_MEAS;
}
/**
 * <B> Function: PFC_StateWait1Cycle(PFC_T *pfcData) </B>
 * @brief PFC_WAIT_1CYCLE: wait for the first RMS window to complete, then
 *        enable PWM and start closed-loop control. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StateWait1Cycle(PFC_T *pfcData)
{
    if(pfcData->vacRMS.status == 1)
    {
        HAL_PFCPWMEnableOutputs();
        return PFC_CTRL_RUN;
    }
    return PFC_WAIT_1CYCLE;
}
/**
 * <B> Function: PFC_StateCtrlRun(PFC_T *pfcData) </B>
 * @brief PFC_CTRL_RUN: the closed-loop control sequence - current feedback,
 *        fault check, soft-start, current-reference generation, boost-duty
 *        estimate, current loop and burst control. Returns the next state.
 */
static PFC_CTRL_STATE_T PFC_StateCtrlRun(PFC_T *pfcData)
{
    PFC_UpdateCurrentFeedback(pfcData);

