dibo1968/pfc_1phases_dspic33ak/project/pfc/pfc.c
    PFC_FaultCheck(pfcData);
    if(pfcData->faultStatus != PFC_FAULT_NONE)
    {
        return PFC_FAULT;
    }

    PFC_SoftStartUpdate(pfcData);
    PFC_CurrentRefGenerate(pfcData);
    PFC_UpdateBoostDutyRatio(pfcData);
    PFC_CurrentControlLoop(pfcData);
    PFC_BurstModeUpdate(pfcData);

    return PFC_CTRL_RUN;
}
/**
 * <B> Function: PFC_StateFault(PFC_T *pfcData) </B>
 * @brief PFC_FAULT: hold PWM off and duty at zero; clear each auto-recovering
 *        fault against its hysteresis limit (IP_OC stays latched). When all
 *        faults clear, re-engage and return to PFC_CTRL_RUN. Returns the next
 *        state.
 */
static PFC_CTRL_STATE_T PFC_StateFault(PFC_T *pfcData)
{
    pfcData->duty = 0;
    pfcData->dutyRatio = 0;
    pfcData->dutyFF = 0;
    HAL_PFCPWMDisableOutputs();

    /** Clear input under-voltage once the input recovers above the UV upper
        (recovery) limit - hysteresis vs the UV trip limit. */
    if(pfcData->vacRMS.sqrOutput >= PFC_INPUT_UNDER_VOLTAGE_LIMIT_HI)
    {
        pfcData->faultStatus &= (~PFC_FAULT_IP_UV);
    }
    /** Clear input over-voltage once the input falls below the OV lower
        (recovery) limit - hysteresis vs the OV trip limit. */
    if(pfcData->vacRMS.sqrOutput < PFC_INPUT_OVER_VOLTAGE_LIMIT_LO)
    {
        pfcData->faultStatus &= (~PFC_FAULT_IP_OV);
    }
    /** Clear output over-voltage only once the bus has bled down below the OV
        recovery limit (hysteresis vs the trip limit). */
    if(pfcData->vdcAVG.output < PFC_OUTPUT_OVER_VOLTAGE_RECOVERY_LIMIT)
    {
        pfcData->faultStatus &= (~PFC_FAULT_OP_OV);
    }
    /** Clear output under-voltage once the bus has climbed back above the UV
        recovery limit. With PWM disabled the bus is passively capped at the
        rectified input peak, so this auto-recovers at nominal/high line; at low
        line it holds off until the bus rises - a slow hiccup, since OP_UV
        re-arms only after soft-start reaches nominal again. */
    if(pfcData->vdcAVG.output >= PFC_OUTPUT_UNDER_VOLTAGE_RECOVERY_LIMIT)
    {
        pfcData->faultStatus &= (~PFC_FAULT_OP_UV);
    }
    /** PFC_FAULT_IP_OC is latching: deliberately never cleared here, so an
        over-current event holds the converter off until a reset
        (PFC_ServiceInit). */
    if(pfcData->faultStatus == PFC_FAULT_NONE)
    {
        pfcData->piVoltage.integralOut = 0;
        pfcData->piCurrent.integralOut = 0;
        pfcData->piVoltage.reference = pfcData->vdcAVG.output;
        HAL_PFCPWMEnableOutputs();
        return PFC_CTRL_RUN;
    }
    return PFC_FAULT;
}
/**
* <B> Function: PFC_ServiceInit()     </B>
* 
* @brief Function calls the PFC_ParamsInit() which initializes the control 
*       parameters.      
* @param none.
* @return none.
* @example
* <CODE> PFC_ServiceInit();        </CODE>
*
*/

void PFC_ServiceInit(void)
{
    /* Make sure ADC does not generate interrupt while initializing parameters*/
	DisablePFCADCInterrupt();
    
    PFC_ParamsInit(&pfcParam);
    
    /* Enable ADC interrupt and begin main loop timing */
    ClearPFCADCIF();
    ClearPFCADCIF_ReadADCBUF();
    EnablePFCADCInterrupt(); 
}
/**
 * <B> Function: PFC_ParamsInit(PFC_T *pfcData)  </B>
 * 
 * @brief Function to initialize PFC related variables 
 * @param Pointer to the data structure containing PFC related variables.
 * PI coefficients, scaling constants etc
 * @return none.
 * @example
 * <code>
 * PFC_ParamsInit(PFC_T *pfcData)
 * </code>
 */
void PFC_ParamsInit(PFC_T *pfcData)
{  
    /** Initialize variables related to RMS calculation - VAC */      
    pfcData->vacRMS.sampleLimit = PFC_RMS_SQUARE_COUNTMAX;
    /** Initialize variables related to Average calculation - VDC */ 
    pfcData->vdcAVG.sampleLimit = PFC_VDC_AVG_SAMPLES;
    
    pfcData->vacAVG.sampleLimit = PFC_INPUT_FREQUENCY_COUNTER;

/** Initialize duty feed-forward. Set before the current-PI limits below,
    which depend on whether it is active. */
    pfcData->dutyFFEnable = PFC_DUTY_FF_ENABLE_DEFAULT;
    pfcData->dutyRatio    = 0;
    pfcData->dutyFF       = 0;
    pfcData->powerCommand = 0;

/** Initialize PI controlling PFC Current Loop */
    pfcData->piCurrent.kp = KP_I;
    pfcData->piCurrent.ki = KI_I;
//    pfcData->piCurrent.kpScale = KP_I_SCALE;
//    pfcData->piCurrent.kiScale = KI_I_SCALE;
    if (pfcData->dutyFFEnable != 0u)
    {
        /* The PI is a trim on top of the feed-forward, so it must be able to
           go negative, and a tight symmetric bound is the anti-windup. */
        pfcData->piCurrent.maxOutput =  PFC_DUTY_TRIM_MAX;
        pfcData->piCurrent.minOutput = -PFC_DUTY_TRIM_MAX;
    }
    else
    {
        /* Legacy: the PI supplies the whole duty. */
        pfcData->piCurrent.maxOutput = PFC_MAX_DUTY;
        pfcData->piCurrent.minOutput = 0;
    }

/** Initialize PI controlling PFC Voltage Loop */    
    pfcData->piVoltage.kp = KP_V;
    pfcData->piVoltage.ki = KI_V;
    pfcData->piVoltage.maxOutput = PI_V_OUT_MAX;
    pfcData->piVoltage.minOutput = 0;
    
    pfcData->state = PFC_INIT;
    pfcData->faultStatus = PFC_FAULT_NONE;
    /* Average-current reconstruction method, see PFC_DCM_COMP_T. Writable at
     * run time so the methods can be A/B'd on a single build. */
    pfcData->sampleCorrectionEnable = PFC_DCM_COMPENSATION_METHOD;
    pfcData->dcmDetected = 0;
    pfcData->iValleyEst = 0.0f;
    pfcData->sampleCorrFactor = 1.0f;

/** Initialize load-current feed-forward (disabled by default). */
    pfcData->loadFF.scale       = PFC_LOAD_CURRENT_SCALE;
    pfcData->loadFF.filtCoeff   = PFC_LOAD_FF_FILT_COEFF;
    pfcData->loadFF.gain        = PFC_LOAD_FF_GAIN;
    pfcData->loadFF.enable      = PFC_LOAD_FF_ENABLE_DEFAULT;
    pfcData->loadFF.currentFilt = 0;
}
/**
 * <B> Function: PFC_ResetParams(PFC_T *pData)  </B>
 * 
 * @brief Function to reset the variables related to moving average filter of 
 * Vdc,variables related to moving average filter of Vac,variables related to 
 * PI integrator and the duty cycle.
 * @param Pointer to the data structure containing PFC related variables
 * @return none
 * @example
 * <code>
 * PFC_ResetParams(PFC_T *pData);
 * </code>
 */
void PFC_ResetParams(PFC_T *pData)
{   
    /** Initialize variables related to moving average filter - Vdc */    
    pData->vdcAVG.sum = 0;
    pData->vdcAVG.samples = 0;
    pData->vdcAVG.status = 0;

