dibo1968/pfc_1phases_dspic33ak/project/pfc/pfc.c
    /** Initialize variables related to moving average filter - Vac */
    pData->vacAVG.sum = 0;
    pData->vacAVG.samples = 0;
    pData->vacRMS.sum = 0;
    pData->vacRMS.samples = 0;
    pData->vacRMS.peak = 0;
    pData->vacRMS.status = 0;

    /** Initialize variables related to PI integrator */
    pData->piVoltage.integralOut = 0;
    pData->piCurrent.integralOut = 0;

    /** Initialize the duty cycle */
    pData->duty = 0;
    pData->dutyRatio = 0;
    pData->dutyFF = 0;
    pData->powerCommand = 0;
}

/**
 * <B> Function: PFC_DcmAverageFactor(PFC_T *pData)  </B>
 *
 * @brief Ratio between the true cycle-average inductor current and the mid-ON
 * sample, i.e. the conduction fraction (d1+d2).
 * @param Pointer to the data structure containing PFC related variables
 * @return correction factor in (0,1]
 * @example
 * <code>
 * factor = PFC_DcmAverageFactor(pData);
 * </code>
 */
static float PFC_DcmAverageFactor(PFC_T *pData)
{
    /* IL is sampled at mid-ON:
     *   CCM: the sample already equals the average IL           -> factor 1.
     *   DCM: the sample is ~Ipk/2, but the cycle-average is LOWER because the
     *        current idles at zero for part of the period:
     *          I_avg = (Ipk/2)*(d1+d2) = sample * (d1 / D_ideal),
     *        with d1 = the ON duty that produced this sample (dutyRatio - NOT
     *        piCurrent.output, which is only the trim once the duty
     *        feed-forward is enabled),
     *        D_ideal = (Vout-Vin)/Vout = boostDutyRatio, and
     *        (d1+d2) = d1/D_ideal < 1 in DCM.
     * Note d2 = d1*Vg/(Vo-Vg) assumes an ideal converter: the diode drop, DCR
     * and Rds_on all stretch the real demagnetising time slightly. */
    float factor = 1.0f;

    if (pData->boostDutyRatio > 0.0f)
    {
        factor = pData->dutyRatio / pData->boostDutyRatio;

        /* Losses/transients can push d1 past D_ideal; that must never inflate
         * the reading, so cap at unity. Under PFC_DCM_COMP_RATIO this cap is
         * also what decides CCM, which is precisely the weakness that
         * PFC_DCM_COMP_VALLEY_EST removes. */
        if (factor > 1.0f)
        {
            factor = 1.0f;
        }
        else if (factor < 0.0f)
        {
            factor = 0.0f;
        }
    }
    return factor;
}
/**
 * <B> Function: PFC_ConductionModeDetect(PFC_T *pData)  </B>
 *
 * @brief Detects CCM/DCM by predicting the inductor current at the end of the
 * OFF time and testing it against zero. Also publishes the estimate itself in
 * pData->iValleyEst for logging.
 * @param Pointer to the data structure containing PFC related variables
 * @return 1 if DCM, 0 if CCM
 * @example
 * <code>
 * pData->dcmDetected = PFC_ConductionModeDetect(pData);
 * </code>
 */
static uint16_t PFC_ConductionModeDetect(PFC_T *pData)
{
    const float d  = pData->dutyRatio;          /* duty that produced this sample */
    const float vg = pData->rectifiedVac;
    const float vo = pData->pfcVoltage.vdc;

    /* Walk the CCM current path forward from the mid-ON sample:
     *    rise over the remaining half of the ON time : +(vg/L)*(d*Ts/2)
     *    fall over the whole OFF time                : +((vg-vo)/L)*(1-d)*Ts
     * Collecting terms,
     *    iValleyEst = i + (Ts/L)*( vg*(1 - d/2) - vo*(1 - d) )
     *
     * In CCM the current really does follow that path, so the estimate is the
     * actual valley and is >= 0. In DCM the current hits zero before the OFF
     * time is up and then sits there, so the continued-slope estimate
     * undershoots into negative territory.
     *
     * The point of doing it this way is the threshold: it is a FIXED zero, not
     * a sampled quantity. Comparing an estimate against a sample (which is what
     * the min(d1/D_ideal,1) clamp effectively does) makes the decision jitter
     * on sample noise right at the boundary, and every toggle is a duty
     * discontinuity that shows up as input current distortion. */
    pData->iValleyEst = pData->iL
                      + (PFC_TS_OVER_L * ((vg * (1.0f - (0.5f * d)))
                                        - (vo * (1.0f - d))));

    return (pData->iValleyEst < 0.0f) ? 1u : 0u;
}
/**
 * <B> Function: PFC_CurrentSampleCorrection(PFC_T *pData)  </B>
 *
 * @brief Function to calculate average value of current in discontinuous
 * conduction mode. Writes averageCurrent, dcmDetected, iValleyEst and
 * sampleCorrFactor.
 * @param Pointer to the data structure containing PFC related variables
 * @return none
 * @example
 * <code>
 * PFC_CurrentSampleCorrection(PFC_T *pData);
 * </code>
 */
static void PFC_CurrentSampleCorrection(PFC_T *pData)
{
    /* Always evaluated, whichever method is driving the loop, so that one run
     * shows what valley estimation would have decided even when it is not the
     * active method. Costs a handful of flops. */
    const uint16_t dcmByValley = PFC_ConductionModeDetect(pData);

    switch (pData->sampleCorrectionEnable)
    {
        case PFC_DCM_COMP_RATIO:
            /* Legacy: the unity cap is the mode decision. Report DCM whenever
             * the cap did not bind, so dcmDetected is directly comparable
             * against the valley method's answer. */
            pData->sampleCorrFactor = PFC_DcmAverageFactor(pData);
            pData->dcmDetected = (pData->sampleCorrFactor < 1.0f) ? 1u : 0u;
            break;

        case PFC_DCM_COMP_VALLEY_EST:
            /* Detect first, then correct only if DCM was actually detected. */
            pData->dcmDetected = dcmByValley;
            pData->sampleCorrFactor = (dcmByValley != 0u)
                                    ? PFC_DcmAverageFactor(pData)
                                    : 1.0f;
            break;

        case PFC_DCM_COMP_OFF:
        default:
            pData->dcmDetected = 0u;
            pData->sampleCorrFactor = 1.0f;
            break;
    }

    pData->averageCurrent = pData->iL * pData->sampleCorrFactor;
}
/**
 * <B> Function: PFC_DutyFeedForward(PFC_T *pData)  </B>
 *
 * @brief Open-loop duty that delivers currentReference at the present
 * operating point, so the current PI only has to trim losses instead of
 * synthesising the whole (Vo-Vg)/Vo profile through its integrator.
 * @param Pointer to the data structure containing PFC related variables
 * @return feed-forward duty ratio in [0, PFC_MAX_DUTY]
 * @example
 * <code>
 * pData->dutyFF = PFC_DutyFeedForward(pData);
 * </code>
 */
static float PFC_DutyFeedForward(PFC_T *pData)
{
    /* CCM: the inductor volt-second balance fixes the duty independently of
     * the current, so the ideal boost ratio IS the feed-forward. */
    float ff = pData->boostDutyRatio;

    /* DCM: volt-second balance no longer pins the duty - the average current
     * is a static function of it,
     *      I_avg = (Ts*Vg*d^2) / (2L*D_ideal)
     * so the duty that open-loop delivers the reference is
     *      d = sqrt( (2L/Ts) * Iref * D_ideal / Vg ).
     * Substituting d = D_ideal shows the two branches meet exactly at the
     * CCM/DCM boundary, so switching between them introduces no step.
     * dcmDetected comes from PFC_CurrentSampleCorrection, which has already
     * run this cycle. */
    if (pData->dcmDetected != 0u)
    {
        /* Vg is floored, not tested: falling back to the CCM branch here would
         * be badly wrong, because at the zero crossing D_ideal -> 1 while the
         * demanded current is ~0 - that would command near-maximum duty into
         * the notch. Flooring instead keeps the expression finite and, since
         * currentReference is proportional to Vg, tapers ff smoothly to zero
         * as Vg does. Above the floor the result is exact. */
        float vg = pData->rectifiedVac;
        float arg;

        if (vg < PFC_DUTY_FF_VG_MIN)
        {
            vg = PFC_DUTY_FF_VG_MIN;
        }
        /* boostDutyRatio goes negative if Vg ever exceeds Vdc (sag, precharge),
         * which would make the argument negative. */
        arg = (PFC_TWO_L_OVER_TS * pData->currentReference
               * pData->boostDutyRatio) / vg;
        ff = (arg > 0.0f) ? sqrtf(arg) : 0.0f;
    }

    /* D_ideal exceeds PFC_MAX_DUTY either side of the zero crossing; the
     * converter simply cannot follow there, so cap rather than command a duty
     * the PWM will clip anyway. */
    if (ff > PFC_MAX_DUTY)
    {
        ff = PFC_MAX_DUTY;
    }
    else if (ff < 0.0f)
    {
        ff = 0.0f;
    }
    return ff;
}
/**
 * <B> Function: PFC_CurrentControlLoop(PFC_T *pData)  </B>
 *
 * @brief Function to execute current control loop of PFC
 * @param Pointer to the data structure containing PFC related variables
 * @return none
 * @example
 * <code>
 * PFC_CurrentControlLoop(PFC_T *pData);
 * </code>
 */
inline static void PFC_CurrentControlLoop(PFC_T *pData)
{
    float dutyRatio;
    float duty;

    /** Ensure PFC current  is not negative.*/
    if (pData->iL < 0)
    {
        pData->iL  = PFC_IL_MIN;
    }
    /** Calculate average current if converter operates in discontinuous
        conduction mode. In continuous conduction mode, measured current is
        used as is ,as average current is obtained. The method is selected by
        pData->sampleCorrectionEnable (PFC_DCM_COMP_T).
        NOTE: this consumes pData->dutyRatio, which still holds the duty that
        produced the present sample - it is only updated at the end of this
        function. */
    PFC_CurrentSampleCorrection(pData);

    /* Populate the reference/input fields for logging. The PI update only
     * consumes .error, so these are purely for a self-describing bus. */
    pData->piCurrent.reference = pData->currentReference;
    pData->piCurrent.input     = pData->averageCurrent;
    pData->piCurrent.error = (pData->currentReference - pData->averageCurrent);

    PFC_ControllerPIUpdate(&pData->piCurrent);

